In [1]:
import pandas as pd

In [5]:
s = pd.Series(['Mari', 'Sonia', 'Julian', 'Felipe', 'Juanjo'])
param = s != 'Mari'
print(s)
print ("···············")
print(s[0])
print ("···············")
print(s[1:4])
print ("···············")
print(s[[0,1,3]])
print("******************")
print(s[param])

0      Mari
1     Sonia
2    Julian
3    Felipe
4    Juanjo
dtype: object
···············
Mari
···············
1     Sonia
2    Julian
3    Felipe
dtype: object
···············
0      Mari
1     Sonia
3    Felipe
dtype: object
******************
1     Sonia
2    Julian
3    Felipe
4    Juanjo
dtype: object

In [17]:
city = {
    'NY':130000000,
    'TX':560003,
    'NMX':45023439,
    'SF':4509123
}
cities = pd.Series(city)
print(cities)

NY     130000000
TX        560003
NMX     45023439
SF       4509123
dtype: int64

In [18]:
cities[['NY', 'SF']]

NY    130000000
SF      4509123
dtype: int64

In [19]:
cities[cities < 4600000] 
print(cities)

NY     130000000
TX        560003
NMX     45023439
SF       4509123
dtype: int64

In [20]:
cities[cities < 4600000] = 500000
print(cities)

NY     130000000
TX        500000
NMX     45023439
SF        500000
dtype: int64

In [26]:
titanic = pd.read_csv('Titanic.txt', sep='\t')
print(titanic.head())

  pclass    age   sex survived
0    1st  adult  male      yes
1    1st  adult  male      yes
2    1st  adult  male      yes
3    1st  adult  male      yes
4    1st  adult  male      yes

In [29]:
titanic['age']

0       adult
1       adult
2       adult
3       adult
4       adult
        ...
2196    adult
2197    adult
2198    adult
2199    adult
2200    adult
Name: age, Length: 2201, dtype: object

In [33]:
titanic[['age', 'pclass']]

        age pclass
0     adult    1st
1     adult    1st
2     adult    1st
3     adult    1st
4     adult    1st
...     ...    ...
2196  adult   crew
2197  adult   crew
2198  adult   crew
2199  adult   crew
2200  adult   crew

[2201 rows x 2 columns]

In [ ]:
titanic[(titanic.age ==)]